<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"594c141743b958017682b86c9f198f40fb1a8391519ea584d3667931a0ea84a0","plan_job_ref":"Job Terraform plan #44 at https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8145646137","plan_out_hash":"f0465aefbc632581c4851acff99ec6eb53f92ad4edb2f86013407442089d420f","plan_hash":"20567d9c6a785e62a3045c27341560be8a98ab7c5efe8f899d98580415ddb6b8","plan_text_format":"diff","version":"1.42.0","closed":true} -->
Terraform plan in __terraform__<details open><summary>With variables</summary>

```hcl
api_registry        = "crpoec718rf5704ehe0c"
api_repository      = "api"
deployer_access_key = (sensitive value)
deployer_secret_key = (sensitive value)
folder_id           = "b1gs3v5tpo5eo8em8ph4"
github_sha          = "d261c376bfc809d534ae15c185aec690a75240d1"
```
</details>
<details>
<summary>Plan: 2 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # yandex_container_registry_iam_binding.api-sa-puller will be created
+   resource "yandex_container_registry_iam_binding" "api-sa-puller" {
+       id          = (known after apply)
+       members     = [
+           "serviceAccount:ajecd77m0gn8g32tuha2",
        ]
+       registry_id = "********************"
+       role        = "container-registry.images.puller"
    }

  # yandex_function.receive-video-handler will be updated in-place
!~  resource "yandex_function" "receive-video-handler" {
        id                 = "d4ef136o48bqjg3sv4q7"
        name               = "receive-video-handler"
        tags               = []
!~      user_hash          = "9533a21059280afe9f47f17f243dfd69333f8e5487c91b398042c957e774a7cf" -> "b314bb25f270d6296b3465c095ca13e1e4ef468dcfa509d7b97fe168bac24d35"
#        (11 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # yandex_serverless_container.test-container is tainted, so must be replaced
-/+ resource "yandex_serverless_container" "test-container" {
+       core_fraction      = (known after apply)
!~      created_at         = "2024-03-04T19:04:13Z" -> (known after apply)
+       execution_timeout  = (known after apply)
!~      folder_id          = "********************" -> (known after apply)
!~      id                 = "********************" -> (known after apply)
-       labels             = {} -> null
        name               = "api"
+       revision_id        = (known after apply)
!~      url                = "https://bbabrhgdvqgkvn2mqvcu.containers.yandexcloud.net/" -> (known after apply)
#        (3 unchanged attributes hidden)

!~      image {
-           args        = [] -> null
-           command     = [] -> null
+           digest      = (known after apply)
-           environment = {} -> null
!~          url         = "cr.yandex/crpoec718rf5704ehe0c/api:2c3309cf380f2e5a73e48cf49ffd175fbc60724e" -> "cr.yandex/crpoec718rf5704ehe0c/api:d261c376bfc809d534ae15c185aec690a75240d1"
        }
    }

Plan: 2 to add, 1 to change, 1 to destroy.
```
</details>

:white_check_mark: Plan applied in [Terraform apply #27](https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8145676965)